# Pandas

## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [2]:
import pandas as pd
import numpy as np

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [3]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

df = pd.DataFrame(data)
df

    Name  Age         City
0   John   16     New York
1  Emily   28  Los Angeles
2   Ryan   22      Chicago

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [4]:
df["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [5]:
salary = [50000, 60000, 45000]
df["Salary"] = salary
df

    Name  Age         City  Salary
0   John   16     New York   50000
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [6]:
age = df["Age"] > 18
df[age]

    Name  Age         City  Salary
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [10]:
df["Birth year"] = pd.to_datetime("now").year - df["Age"]
df

G:\mate\data_science\py-pandas\venv\Lib\site-packages\pandas\core\arrays\datetimes.py:2224: FutureWarning: The parsing of 'now' in pd.to_datetime without `utc=True` is deprecated. In a future version, this will match Timestamp('now') and Timestamp.now()
  result, tz_parsed = tslib.array_to_datetime(

    Name  Age         City  Salary  Birth year
0   John   16     New York   50000        2007
1  Emily   28  Los Angeles   60000        1995
2   Ryan   22      Chicago   45000        2001

### Task 4.2

Add new calculated field `Average age`.

In [20]:
df["Average age"] = df["Age"].sum() / df["Age"].count()
df

    Name  Age         City  Salary  Birth year  Average age
0   John   16     New York   50000        2007         22.0
1  Emily   28  Los Angeles   60000        1995         22.0
2   Ryan   22      Chicago   45000        2001         22.0

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [30]:
df["Absolute_difference"] = abs(df["Age"] - df["Average age"])
df

,Name,Age,City,Salary,Birth year,Average age,Absolute_difference
0,John,16,New York,50000,2007,22.0,6.0
1,Emily,28,Los Angeles,60000,1995,22.0,6.0
2,Ryan,22,Chicago,45000,2001,22.0,0.0

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [25]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

df_1 = pd.DataFrame(data1)
df_2 = pd.DataFrame(data2)

In [27]:
df_merge = pd.merge(df_1, df_2, how="outer", on="Name")
df_merge

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0  Los Angeles
2   Ryan  22.0      Chicago
3   Mike   NaN      Houston

In [86]:
df_concat = pd.concat([df_1, df_2])
df_concat

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0          NaN
2   Ryan  22.0          NaN
0  Emily   NaN  Los Angeles
1   Ryan   NaN      Chicago
2   Mike   NaN      Houston

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [88]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [90]:
s3 = s1 + s2
s3

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [92]:
s4 = s1 - s2
s4

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [94]:
s5 = s1 * s2
s5

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [96]:
s6 = s1 / s2
s6

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [98]:
s7 = s1 ** s2
s7

0          1
1        128
2       6561
3     262144
4    9765625
dtype: int64

In [101]:
s8 = s2 // s1
s8

0    6
1    3
2    2
3    2
4    2
dtype: int64

In [104]:
s9 = s2 % s1
s9

0    0
1    1
2    2
3    1
4    0
dtype: int64

In [106]:
s10 = s1[s1 % 2 == 0]
s10

1    2
3    4
dtype: int64

In [108]:
s11 = s2[s2 % 2 != 0]
s11

1    7
3    9
dtype: int64

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [110]:
s = pd.Series(["numpy", "pandas", "matplotlib"])

In [114]:
s_upper = s.astype(str).str.upper()
s_upper

0         NUMPY
1        PANDAS
2    MATPLOTLIB
dtype: object

In [122]:
s_length = s.str.len()
s_length

0     5
1     6
2    10
dtype: int64

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [132]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]
    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

CPU times: total: 8.48 s
Wall time: 8.48 s

[31.8, 42.6, 43.6, 32.6, 25.8, 29.6, 28.0, 31.4, 33.0, 38.0]

### Solution using Pandas and Numpy

In [22]:
def estimate_time():
    s_set = pd.Series(np.random.randint(0, 100, size=10000000))
    s_avg = s_set.rolling(window=5).mean().dropna()
    return s_avg

%time estimate_time()

CPU times: total: 469 ms
Wall time: 469 ms

4     32.6
5     25.0
6     35.8
7     33.4
8     30.0
9     46.2
10    58.2
11    48.0
12    44.4
13    55.8
dtype: float64